Autodesk.Revit.DB.Electrical.AnalyticalLoadScenariosData.GetLoadScenarioFactor(Autodesk.Revit.DB.ElementId)
Gets the load scenario factor.
loadScenarioId:
The load scenario id.
Returns:
The load scenario factor.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId loadScenarioId is not an Analytical LoadScenario.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.AnalyticalLoadScenariosData.SetLoadScenarioFactor(Autodesk.Revit.DB.ElementId,System.Double)
Sets load scenario factor.
loadScenarioId:
The load scenario id.
dFactor:
The value of load scenario factor.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId loadScenarioId is not an Analytical LoadScenario.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for factor must be between 0 and 100.

Autodesk.Revit.DB.Electrical.AnalyticalLoadScenariosData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.AnalyticalLoadScenariosData
Represents the electrical analytical load scenarios data.
The map used to cache load case values modified by user.
If the load case uses default values, it won't be exist in this map.